[
  {

    "maker": "Valve",
    "images": [
      "https://cdn.akamai.steamstatic.com/steam/apps/70/capsule_616x353.jpg?t=1591048039",
      "https://cdn.mos.cms.futurecdn.net/cgLbkdDrgJQ96b7ZuCHJcW.jpg",
      "https://cdn.akamai.steamstatic.com/half-life.com/images/halflife/halflife_1.jpg"
    ],

    "buyLink": "https://www.half-life.com/bg/halflife",
    "title": "Half-Life",
    "description": "Game is created at 1998 year.Its first-person shooter developed by Valve and published by Sierra Studios for Windows.It was Valve's debut product and first game of Half-Life series.Players start in role as Gordon Freeman,a scientist who must escape The Black Mesa Research Facility after it is invaded by aliens.The gameplay consists of combat,exploration and puzzle-solving.Unlike other games of its time,the player has almost uninterrupted control of the player character,and the story is mostly in scripted sequences rather thatn cutscenes.Valve co-founder Gabe Newell said that the team was disappointed with the lack of innovation in the FPS(First-Person Shooter)genre,and aimed to create an immersive world rather than a shooting gallery.Half-Life received acclaim for its graphics, gameplay, and narrative, and won over 50 PC 'Game of the Year awards'. It is considered one of the most influential FPS games and one of the best video games ever made. By 2008, it had sold over nine million copies. It was followed by the expansion packs Opposing Force (1999) and Blue Shift (2001), developed by Gearbox Software. It was ported to the PlayStation 2 in 2001, along with the expansion Half-Life: Decay, and to OS X and Linux in 2013. Valve ported Half-Life to its Source engine as Half-Life: Source in 2004. In 2020, Crowbar Collective released an unofficial remake, Black Mesa."
    
      
  },
  {

    "maker": "Valve",
    "images": [
      "https://highxtar.com/wp-content/uploads/2020/06/highxtar-counter-strike-1.6.jpg",
      "https://cdn.akamai.steamstatic.com/steam/apps/10/0000000132.1920x1080.jpg?t=1602535893",
      "https://se7en.ws/wp-content/uploads/2016/02/0000002540.1920x1080.jpg"
    ],
    "buyLink": "https://store.steampowered.com/app/10/CounterStrike/",
    "title": "Counter Strike 1.6",
    "description": " Game is a series of multiplayer first-person shooter video games in which teams of terrorists battle to perpetrate an act of terror (bombing, hostage-taking, assassination) while counter-terrorists try to prevent it (bomb defusal, hostage rescue, escort mission). The series began on Windows in 1999 with the release of the first game, Counter-Strike. It was initially released as a modification (mod) for Half-Life that was designed by Minh 'Gooseman' Le and Jess 'Cliffe'Cliffe before the rights to the mod's intellectual property were acquired by Valve, the developers of Half-Life, who then turned Counter-Strike into a retail product.The original Counter-Strike was followed by Counter-Strike: Condition Zero, developed by Turtle Rock Studios and released in March 2004. A previous version of Condition Zero that was developed by Ritual Entertainment was released alongside it as Condition Zero: Deleted Scenes. Eight months later, Valve released Counter-Strike: Source, a remake of the original Counter-Strike and the first in the series to run on Valve's newly created Source engine.[4] The fourth game in the main series, Counter-Strike: Global Offensive, was released by Valve in 2012 for Windows, OS X, Xbox 360, and PlayStation 3. Hidden Path Entertainment, who worked on Counter-Strike: Source post-release, helped to develop the game alongside Valve.There have been several third-party spin-off titles created for Asian markets over the years. These include the Counter-Strike Online series, Counter-Strike Neo, and Counter-Strike Nexon: Studio."
  },
  {

    "maker": "Blizzard",
    "images": [
      "https://img.usfine.biz/uploads/201906/thumb_efa3f62350b2351a8986eef5fb362530.png",
      "https://cdn.mos.cms.futurecdn.net/x4MWxVRUD5qgEUMYKvKoLc.jpg",
      "https://windowscentral.com/sites/wpcentral.com/files/styles/large/public/field/image/2022/04/world-of-warcraft-classic-lich-king-key-art.jpg"
    ],
    "buyLink": "https://worldofwarcraft.com/en-us/",
    "title": "World of Warcraft",
    "description": " Game is a massively multiplayer online role-playing game (MMORPG) released in 2004 by Blizzard Entertainment. Set in the Warcraft fantasy universe, World of Warcraft takes place within the world of Azeroth, approximately four years after the events of the previous game in the series, Warcraft III: The Frozen Throne. The game was announced in 2001, and was released for the 10th anniversary of the Warcraft franchise on November 23, 2004. Since launch, World of Warcraft has had eight major expansion packs: The Burning Crusade (2007), Wrath of the Lich King (2008), Cataclysm (2010), Mists of Pandaria (2012), Warlords of Draenor (2014), Legion (2016), Battle for Azeroth (2018), and Shadowlands (2020), with a ninth, Dragonflight, currently in development.Similar to other MMORPGs, the game allows players to create a character avatar and explore an open game world in third- or first-person view, exploring the landscape, fighting various monsters, completing quests, and interacting with non-player characters (NPCs) or other players. The game encourages players to work together to complete quests, enter dungeons and engage in player versus player (PvP) combat, however the game can also be played solo without interacting with others. The game primarily focuses on character progression, in which players earn experience points to level up their character to make them more powerful and buy and sell items using in-game currency to acquire better equipment, among other game systems.World of Warcraft was a major critical and commercial success upon its original release in 2004 and quickly became the most popular MMORPG of all time, reaching a peak of 12 million subscribers in 2010. The game had over one hundred million registered accounts by 2014 and by 2017, had grossed over $9.23 billion in revenue, making it one of the highest-grossing video game franchises of all time. The game has been cited by gaming journalists as the greatest MMORPG of all time and one of the greatest video games of all time and has also been noted for its long lifespan, continuing to receive developer support and expansion packs over 15 years since its initial release.In 2019, a vanilla version of the game titled World of Warcraft Classic was launched, allowing players to experience the base game before any of its expansions launched."
  },
  {

    "maker": "Riot Games",
    "images": [
      "https://www.leagueoflegends.com/static/logo-1200-589b3ef693ce8a750fa4b4704f1e61f2.png",
      "https://cdn.garenanow.com/web/image/lol/landing-dominion/SG-EN/2022/FEB/SEASONSTART/1220x400.jpg",
      "https://img.redbull.com/images/c_limit,w_1500,h_1000,f_auto,q_auto/redbullcom/2018/08/03/4ebc1dd1-b676-4407-bbac-450aeea68325/league-of-legends-top-tips"
    ],
    "buyLink": "https://www.leagueoflegends.com/en-gb/",
    "title": "League of Legends",
    "description": " Game commonly referred to as League, is a 2009 multiplayer online battle arena video game developed and published by Riot Games. Inspired by Defense of the Ancients, a custom map for Warcraft III, Riot's founders sought to develop a stand-alone game in the same genre. Since its release in October 2009, the game has been free-to-play and is monetized through purchasable character customization. The game is available for Microsoft Windows and macOS.In the game, two teams of five players battle in player versus player combat, each team occupying and defending their half of the map. Each of the ten players controls a character, known as a 'champion', with unique abilities and differing styles of play. During a match, champions become more powerful by collecting experience points, earning gold, and purchasing items to defeat the opposing team. In the game's main mode, Summoner's Rift, a team wins by pushing through to the enemy base and destroying their 'Nexus', a large structure located within.League of Legends received generally positive reviews,critics highlighted its accessibility, character designs, and production value. The game's long lifespan has resulted in a critical reappraisal, with reviews trending positively,the negative and abusive in-game behavior of its players, criticized since early in the game's lifetime, persists despite Riot's attempts to fix the problem. In 2019, the game regularly peaked at eight million concurrent players, and its popularity has led to tie-ins such as music videos, comic books, short stories, and an animated series, Arcane. Its success has also spawned several spin-off video games, including a mobile version, a digital collectible card game and a turn-based role-playing game, among others. A massively multiplayer online role-playing game based on the property is in development.Regularly cited as the world's largest esport, the game has an international competitive scene consisting of 12 leagues. These domestic leagues culminate in the annual League of Legends World Championship. The 2019 event registered over 100 million unique viewers, peaking at a concurrent viewership of 44 million. Domestic and international events have been broadcast on livestreaming websites such as Twitch, YouTube, Bilibili, and on cable television sports channel ESPN."
  },
  {
    "maker": "Ubisoft",
    "images": [
      "https://www.hrkgame.com/media/games/.thumbnails/Buy_Tom_Clancys_Rainbow_Six_Siege_-_Deluxe_Edition_Uplay_PC_CD_KEY_HRKGame.jpg/Buy_Tom_Clancys_Rainbow_Six_Siege_-_Deluxe_Edition_Uplay_PC_CD_KEY_HRKGame-800x500.jpg",
      "https://images.gamersyde.com/image_stream-40858-2991_0002.jpg",
      "https://static3.cdn.ubi.com/orbit/uplaynews/_UplayNews2021/RainbowSix/R6_MTX_Y6S1_IMG_Apocalypse_overlay.jpg"
    ],
    "buyLink": "https://www.g2a.com/tom-clancys-rainbow-six-siege-standard-edition-ubisoft-connect-key-global-i10000005416006",
    "title": "Tom Clancy's Rainbow Six Siege",
    "description": "Tom Clancy's Rainbow Six Siege is an online tactical shooter video game developed by Ubisoft Montreal and published by Ubisoft. It was released worldwide for Microsoft Windows, PlayStation 4, and Xbox One on December 1, 2015; the game was also released for PlayStation 5 and Xbox Series X and Series S exactly five years later on December 1, 2020. The game puts heavy emphasis on environmental destruction and cooperation between players. Each player assumes control of an attacker or a defender in different gameplay modes such as rescuing a hostage, defusing a bomb, and taking control of an objective within a room. The title has no campaign but features a series of short, offline missions called, 'situations' that can be played solo. These missions have a loose narrative, focusing on recruits going through training to prepare them for future encounters with the 'White Masks', a terrorist group that threatens the safety of the world.Siege is an entry in the Rainbow Six series and the successor to Tom Clancy's Rainbow 6: Patriots, a tactical shooter that had a larger focus on narrative. After Patriots was eventually cancelled due to its technical shortcomings, Ubisoft decided to reboot the franchise. The team evaluated the core of the Rainbow Six franchise and believed that letting players impersonate the top counter-terrorist operatives around the world suited the game most. To create authentic siege situations, the team consulted actual counter-terrorism units and looked at real-life examples of sieges such as the 1980 Iranian Embassy siege. Powered by AnvilNext 2.0, the game also utilizes Ubisoft's RealBlast technology to create destructible environments.The game received an overall positive reception from critics, with praise mostly directed to the game's tense multiplayer and focus on tactics. However, the game was criticized for its progression system and its lack of content. Initial sales were weak, but the game's player base increased significantly as Ubisoft adopted a 'games as a service' model for the game and subsequently released several packages of free downloadable content. Several years after the game's release, some critics regarded Siege as one of the best multiplayer games in the modern market due to the improvements brought by the post-launch updates. The company partnered with ESL to make Siege an esports game. In December 2020, the game surpassed 70 million registered players across all platforms. Rainbow Six Extraction, a spin-off game featuring Siege characters, was released in January 2022."
  },
  {
    "maker": "FacePunch",
    "images": [
      "https://static3.srcdn.com/wordpress/wp-content/uploads/2021/05/Rust-Console-Edition-Review.jpg",
      "https://static1.srcdn.com/wordpress/wp-content/uploads/2021/01/Rust-Fight.jpg?q=50&fit=crop&w=943&h=500&dpr=1.5",
      "https://cdn.vox-cdn.com/thumbor/0Kt93UHcZqx4NG8_UT50YVm9xFI=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19377733/Rust_Thumbnail__Shadowfrax.png"
    ],
    "buyLink": "https://store.steampowered.com/agecheck/app/252490/",
    "title": "Rust",
    "description": "Rust is a multiplayer-only survival video game developed by Facepunch Studios. Rust was first released in early access in December 2013 and received its full release in February 2018. Rust is available on Microsoft Windows and macOS. Console versions for PlayStation 4 and Xbox One being developed in conjunction with Double Eleven were released in May 2021. Rust was initially created as a clone of DayZ, a popular mod for ARMA 2, with crafting elements akin to those in Minecraft.The objective of Rust is to survive in the wilderness using gathered or stolen materials. Players must successfully manage their hunger, thirst, and health, or risk dying. Despite the presence of hostile animals such as bears and wolves, the primary threat to the player is other players due to the game being solely multiplayer. Combat is accomplished through firearms and various weapons, such as bows. In addition, vehicles controlled by non-player characters will occasionally roam, attacking armed players. Rust features crafting, though initially limited until the discovery of specific items in the game's open world. To stay protected, players must build bases or join clans to improve their chance of survival. Raiding is a major aspect of Rust. Rust supports modded servers which can add additional content.Rust was first released in December 2013 to the Steam Early Access program. During this period of development, the gameplay was changed significantly. Dangerous wildlife replaced zombies as the primary environmental threat and several fundamental revisions to the crafting system were released, along with general improvements and feature additions. While in Early Access, Rust was ported to the Unity 5 game engine, providing substantial graphical changes. The game also introduced immutable, predetermined skin colour and biological sex tied to players' Steam account details. Despite being fully released, the game continues to receive updates.Throughout Rust's alpha release, critical reviews were mixed, with many comparisons made to other survival games. Rust was commonly explained as being a mixture of DayZ and Minecraft. During this period, reviewers frequently noted the game's unfinished nature. During its pre-release phase, critics praised the concept and gameplay and by March 2017, Rust had sold over five million copies. After leaving Early Access, it received mixed reviews from critics. The player vs player combat and survival aspects were highlighted by those who enjoyed the game, though reviewers were critical of the harsh beginner experience and the constant need to grind for materials."
  }
]